[net]
width=96
height=96
channels=3
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=64
kernel_size=1
stride=2
[batchnorm]
[route]
layers=-3
[batchnorm]
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=64
kernel_size=3
stride=2
[batchnorm]
[shortcut]
from=-8
[batchnorm]
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[convolutional]
out_ch=128
kernel_size=1
stride=2
[batchnorm]
[route]
layers=-3
[batchnorm]
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=128
kernel_size=3
stride=2
[batchnorm]
[shortcut]
from=-8
[batchnorm]
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[batchnorm]
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[convolutional]
out_ch=256
kernel_size=1
stride=2
[batchnorm]
[route]
layers=-3
[batchnorm]
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=256
kernel_size=3
stride=2
[batchnorm]
[shortcut]
from=-8
[batchnorm]
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[batchnorm]
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[convolutional]
out_ch=256
kernel_size=1
stride=2
[batchnorm]
[route]
layers=-3
[batchnorm]
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=256
kernel_size=3
stride=2
[batchnorm]
[shortcut]
from=-8
[batchnorm]
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=prelu
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[shortcut]
from=-7
[batchnorm]
[flatten]
[connected]
output=128
[batchnorm]
