[net]
width=224
height=224
channels=3
yolo_version=3
[convolutional]
out_ch=16
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=32
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=64
kernel_size=1
stride=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=128
kernel_size=1
stride=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=256
kernel_size=1
stride=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=256
kernel_size=1
stride=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=30
kernel_size=1
stride=1

[region]
anchors = 0.2901,0.6292, 0.7770,1.7555, 1.4236,3.5353, 2.6815,4.8071, 5.1381,5.6096

classes=1
coords=4
num=5
softmax=1


