[net]
width=224
height=224
channels=3
[convolutional]
out_ch=16
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=32
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=64
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=128
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=2
size=2
[convolutional]
out_ch=512
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[maxpool]
stride=1
size=2
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=256
kernel_size=3
stride=1
pad=1
[batchnorm]
[activation]
activation=leaky
arg=0.10000000149011612
[convolutional]
out_ch=35
kernel_size=1
stride=1
